Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འདི་དག་ནི་རྣམ་གྲངས་བཅུ་གཅིག་གོ། །ད་ནི་མདོར་བསྟན་པ་འདིའི་ཚིག་གི་དོན་བསྟན་པར་བྱའོ།
en: Explanation of the Brief Teaching Now I shall teach the meaning of the words in the brief statement.

source: །ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་དེ་ལ་ཤཱ་རིའི་བུ་ཞེས་བྱ་བ་ནི་གནས་བརྟན་གྱི་མའི་མིང་ལས་དྲས་ཏེ་བོས་པའོ།
en: There, in, “Here, Śāriputra, bodhisattva great beings who want to fully awaken to all dharmas in all forms should make an effort at the perfection of wisdom,” “Śāriputra [Son of Śāradvatī]” is called by the name of the elder’s mother. “

source: །འདི་ལ་ཞེས་བྱ་བ་ནི་ཐེག་པ་ཆེན་པོ་བསྟན་པ་ལ་འམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་ལ་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་འདི་ལ་གནས་ཏེ་ཞེས་བྱ་བའམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་ཞེས་བྱ་བར་སྦྱར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ལ།
en: Here” should be construed as “in this” Great Vehicle discourse, or “in this” perfection of wisdom discourse, that is, put it together as: The bodhisattva great beings stand in this Great Vehicle, or in this perfection of wisdom. “

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་རྣམ་པ་གཉིས་ཏེ། ཀུན་རྫོབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: Bodhisattva”— bodhisattva is twofold: the conventional bodhisattva and the ultimate bodhisattva.

source: དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའོ། །གང་གི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་། སེམས་ཅན་ལ་དམིགས་ནས་སྐྱེས་པའི་སེམས་དང་པོ་ནི་བྱང་ཆུབ་དང་། སེམས་ཅན་ལ་དམིགས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: The first thought that has arisen with perfect, complete awakening and beings as its objective support is called bodhisattva because it has awakening (bodhi) and beings (sattva) as its objective support.

source: །སེམས་དེ་གང་ལ་ཡོད་པ་དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: Whoever has that thought is also called a bodhisattva. Because they have thought, “Yes!

source: །ཨེ་མའོ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ཤིན་ཏུ་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པ་ལ་དགོད་པར་བྱའོ་སྙམ་དུ་བསམས་ཏེ། བྱང་ཆུབ་དང་སེམས་ཅན་ལ་དམིགས་ནས་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་གཉིས་ལ་གནས་ཏེ་ཤེས་རབ་དང་སྙིང་རྗེ་གཉིས་ཀྱི་སེམས་རིན་པོ་ཆེ་བསྐྱེད་པ་དང་ལྡན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: I will become an unsurpassed and perfectly complete buddha and establish all beings in the absolutely complete nirvāṇa,” and because they stand, with awakening and beings as the objective support, in both the conventional and ultimate truth, in possession of the precious thought that is both wisdom and compassion, they are bodhisattvas.

source: །རབ་ཏུ་དགའ་བ་ལ་སོགས་པ་སེམས་བསྐྱེད་པ་བཅུ་ལ་དོན་དམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: The ultimate bodhisattvas are the ten thoughts of awakening on the Pramuditā level, and so on.

source: །སློབ་དཔོན་གཞན་དག་འཆད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཡིན་ནོ་ཞེས་འབྱུང་བས་སེམས་ཅན་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་ཡིན་ནོ་དེ་བཞིན་ཉིད་དེ་ལ་ཡང་གནས་སྐབས་གསུམ་ཡོད་དེ། མ་དག་པའི་གནས་སྐབས་དང་། དག་པ་དང་མ་དག་པའི་གནས་སྐབས་དང་། ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་གནས་སྐབས་སོ།
en: Other masters say: Because of the statement “all beings are tathāgata­garbha,” all beings are born through their tathatā (“suchness” or “reality”), and that suchness has three phases: an impure phase, a pure and impure phase, and a completely pure phase.

source: །དེ་ལ་མ་དག་པའི་གནས་སྐབས་ནི་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ལ་བྱང་ཆུབ་ཀྱི་གནས་སྐབས་ནི་མེད་ཀྱི། སེམས་དཔའི་གནས་སྐབས་འབའ་ཞིག་ཏུ་ཟད་པས་ནི་དེ་བཞིན་ཉིད་དེ་ལ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་དུ་བརྗོད་དོ།
en: Among these, in all ordinary beings in the impure phase there is no awakening period, it is only the phase of the “sentient being state” (sattva) alone, so that suchness is given the name sattva.

source: །དག་པ་དང་མ་དག་པའི་གནས་སྐབས་ཀྱི་འཕགས་པ་རྣམས་ལ་ནི་བྱང་ཆུབ་པའི་གནས་སྐབས་དང་། སེམས་དཔའི་གནས་སྐབས་གཉིས་ཀ་ཡོད་དེ་དག་པ་དང་མ་དག་པའི་དེ་བཞིན་ཉིད་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་མིང་དུ་བརྗོད་དོ།
en: In superior beings in the pure and impure phase there is both a bodhi (“awakening”) period and a sattva (“sentient being state”) phase, so, that pure and impure suchness is given the name bodhisattva (“awakening and sentient being state”).

source: །ཡོངས་སུ་དག་པའི་གནས་སྐབས་ན་ནི་བྱང་ཆུབ་ཀྱི་གནས་སྐབས་འབའ་ཞིག་ཏུ་ཟད་པས། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་མིང་དུ་བརྗོད་དེ།
en: The completely pure period is during the awakening period alone, so at that time it is given the name tathāgata (“realized”).

source: ཇི་སྐད་དུ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དེ་ནི་ཡང་དག་པ་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་བླ་དྭགས་སོ་ཞེས་གསུངས་པ་ལྟ་བུའོ། །སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་ནི་འབྲས་བུ་དང་མཐུན་པའི་རིགས་དང་། རིགས་དང་མཐུན་པའི་མོས་པ་དང་། མོས་པ་དང་མཐུན་པའི་བསམ་པ་དང་། བསམ་པ་དང་མཐུན་པའི་སྨོན་ལམ་དང་། སྨོན་ལམ་དང་མཐུན་པའི་སྤྱོད་པ་དང་། སྤྱོད་པ་དང་མཐུན་པའི་བརྩོན་འགྲུས་དང་། བརྩོན་འགྲུས་དང་མཐུན་པའི་དུས་དང་།
en: As it says:“Tathāgata (‘Realized one’), Subhūti, is a term for perfect reality (‘tathatā’).” “

source: དུས་དང་མཐུན་པའི་ཚོགས་དང་། ཚོགས་དང་མཐུན་པའི་ཡང་དག་པར་འགྲུབ་པ་དང་། ཡང་དག་པར་འགྲུབ་པ་དང་མཐུན་པའི་འབྲས་བུ་དང་། འབྲས་བུ་དང་མཐུན་པའི་སེམས་ཅན་གྱི་དོན་དང་། ཆེན་པོ་རྣམ་པ་བཅུ་གཅིག་ཡོད་པ་འདི་དག་དང་ལྡན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱའོ།
en: Great beings”— a bodhisattva is a great being because of being endowed with eleven types of greatness: possessing a lineage in accord with the result, a belief in accord with the lineage, intention in accord with the belief, a prayer that is a vow in accord with the intention, a course of conduct in accord with the prayer that is a vow, perseverance in accord with the course of conduct, duration in accord with perseverance, accumulation in accord with duration, achievement in accord with accumulation, a result in accord with the achievement, and the welfare of beings in accord with the result. “

source: །ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་འདིས་ནི་ཇི་སྙེད་ཡོད་པ་བསྟན་ཏོ།
en: All dharmas”— this indicates the diversity of suchness. “

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཞེས་བྱ་བ་འདིས་ཇི་ལྟ་བ་བཞིན་དུ་ཡོད་པ་བསྟན་ཏོ།
en: In all forms”— this indicates the nature of suchness. “

source: །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པ་ཞེས་བྱ་བས་ནི་མངོན་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སེམས་པ་བསྟན་ཏོ།
en: Want to fully awaken”— this indicates the intention to awaken fully.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ལ་ཆོས་ནི་རྣམ་པ་གཉིས་ཏེ། ཀུན་བརྟགས་པའི་ཆོས་རྣམས་དང་། ཡོངས་སུ་གྲུབ་པའི་ཆོས་རྣམས་སོ།
en: There, the dharmas in “all dharmas” are two: imaginary dharmas and thoroughly established dharmas. “

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཞེས་བྱ་བ་ལ་རྣམ་པ་གཉིས་ཏེ། ཀུན་རྫོབ་ཀྱི་རྣམ་པ་དང་། དོན་དམ་པའི་རྣམ་པའོ།
en: In all forms” has two aspects: conventional and ultimate.

source: །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་ལ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ནི་རྣམ་པ་གཉིས་ཏེ། ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སོ། །དེ་ལ་ཀུན་བརྟགས་པའི་ཆོས་འཇིག་རྟེན་གསུམ་དུ་གཏོགས་པ་དང་། དུས་གསུམ་དུ་གཏོགས་པ་རྣམས་ནི་འཇིག་རྟེན་པའི་ཀུན་རྫོབ་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པོ། །ཡོངས་སུ་གྲུབ་པའི་ཆོས་རྣམས་ནི་འཇིག་རྟེན་ལས་འདས་པ་སྐྱེ་བ་མེད་པ་དང་།
en: The full awakening in “want to fully awaken” has two aspects: a knower of all-knowledge and a knower of the knowledge of all aspects, which is to say, there is full awakening as a knower who knows all ordinary conventional aspects—all falsely imagined dharmas included in the three realms and included in the three periods of time.

source: འགག་པ་མེད་པ་དང་། གཟོད་མ་ནས་ཞི་བ་དང་། རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། སྟོང་པ་ཉིད་ལ་སོགས་པའི་རྣམ་པར་ཐར་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་སྟེ།
en: And there is full awakening as a knower who knows all aspects of the transcendental thoroughly established dharmas—nonarising, nonstopping, being calm from the beginning, being naturally in nirvāṇa, the intrinsic nature that is a nonexistent thing, and the liberations of emptiness and so on.

source: དེ་བས་ན་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་གསུངས་སོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཞེས་བྱ་བ་ནི་དེ་ལ་དོན་དམ་པར་སྨོན་ལམ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་། ཉོན་མོངས་པ་དང་། ལས་དང་། སྡུག་བསྔལ་དང་།
en: Thus, it says “want to fully awaken… in all forms.”

source: འཁོར་བ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོན་ཏན་དང་། ཤེས་པར་བྱ་བ་དང་། རྣམ་པ་འདི་དགུའི་ཕ་རོལ་དུ་སོན་པའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་རྣམ་པར་མི་རྟོག་པའི་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་བསྡུས་པ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །དེ་ནས་དེའི་རྗེས་ལ་ཐོབ་པ་རྣམ་པར་རྟོག་པ་དང་བཅས་པ་དང་།
en: As for “at the perfection of wisdom (prajñāpāramitā),” because it has ultimately gone beyond (pāramitā) nine things (prayer, what has been undertaken by making an effort, the afflictions, karma, suffering, saṃsāra, conceptualization, good qualities, and the knowable), what is brought together in the nonconceptual vajra-like meditative stabilization, the transcendental knowledge (jñāna), is called perfection of wisdom.

source: རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་མེ་ལོང་ལྟ་བུ་དང་། མཉམ་པ་ཉིད་དང་། སོ་སོར་རྟོག་པ་དང་། བྱ་བ་སྒྲུབ་པའི་ཡེ་ཤེས་རྣམས་ཀྱང་དེའི་རྒྱུ་ལས་བྱུང་བའི་ཕྱིར་འབྲས་བུ་ལ་རྒྱུས་བཏགས་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བར་བསྟན་ཏོ།
en: And, giving the name of the cause to the result, it teaches that the conceptual and nonconceptual mirror-like knowledge, the knowledge of sameness, discriminating knowledge, and the accomplishing knowledge attained subsequent to that are the perfection of wisdom, because they are caused by it.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་མཐར་ཕྱིན་པའི་སས་བསྡུས་པ་དགྲ་བཅོམ་པའི་ལམ་གྱི་ཡེ་ཤེས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་ཡིན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་འཐོབ་པར་འགྱུར་རོ།
en: The path knowledge of the worthy one included in the final śrāvaka and pratyekabuddha levels is also the concordant cause that is the perfection of wisdom, so it gets to be the perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པས་སྤྱོད་པའི་ས་ནས་ཉེ་བར་བཟུང་སྟེ། ས་བཅུ་ཆོས་ཀྱི་སྤྲིན་གྱི་བར་དུ་མཉན་པ་དང་བསམས་པ་དང་། བསྒོམས་པ་ལ་སོགས་པའི་རིམ་པས་མངོན་པར་འཕེལ་བ་ཆོས་ཀྱི་དབྱིངས་དྲི་མ་མེད་པར་བྱེད་པའི་ཐབས་ཀྱིས་ཟིན་པ་ཀུན་ཏུ་འགྲོ་བའི་དོན་དང་། མཆོག་གི་དོན་ལ་སོགས་པར་དེ་བཞིན་ཉིད་ལ་འཇུག་པའི་ཁྱད་པར་མངོན་སུམ་དུ་བྱེད་པས་ས་དང་ས་དག་ལ་གནས་དག་པའི་ཡེ་ཤེས་ཇེ་ཆེ་ཇེ་ཆེར་གྱུར་པས་ལྷག་པར་རྟོག་པའི་ཁྱད་པར་ཐོབ་པར་བྱེད་པའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་ཐོབ་པ་ཉིད་དུ་འགྱུར་རོ། །དེ་ཉིད་སྒྲུབ་པ་དང་།
en: Those knowledges, from the bodhisattva’s devoted course of conduct level up to the tenth Dharmameghā level, distinguished by increasing through the stages of listening, thinking, meditation, and so on; making the dharma-constituent stainless; being informed by method; entering into suchness as an omnipresent suchness, as the highest suchness, and so on; and, as actualization, causing the attainment of a special feature, the surpassing realization, on account of purified knowledge located on level after level having become bigger and bigger, also get the name perfection of wisdom.

source: རྟོགས་པ་དང་། མཐར་ཕྱིན་པའི་སའི་ཏིང་ངེ་འཛིན་ལ་གནས་པའི་ཚིག་གི་དོན་མ་ལུས་པའི་ཁྱད་པར་རྟོགས་པར་བྱེད་པའི་རྒྱུ་ཡིན་པའི་ཕྱིར། མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་སུ་གྱུར་པའི་ཆོས་བསྟན་པ་གང་ཡིན་པ་དེ་དག་ལ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་ཉིད་དུ་བརྗོད་དོ།
en: Because they are the causes that bring about the realization distinguished by all the topics to do with the practice and realization of, and abiding in, the meditative stabilization on the final level that is just that [perfection of wisdom], that collection of words, collection of sentences, and collection of knowledges dedicated to Dharma teaching are also entitled perfection of wisdom.

source: །དེ་ལྟར་ཇི་ཙམ་དུ་རྣམ་པ་དེ་དག་ཉིད་མངོན་པར་སྟོན་པ་ཐེག་པ་ཆེན་པོའི་ཚུལ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Thus, those Great Vehicle modes of explanation, to the extent that they directly teach just those aspects, are all the perfection of wisdom.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བར་བརྗོད་པ་དེ་དག་ལས་འདི་ནི་སངས་རྒྱས་ཀྱི་སས་བསྡུས་པའི་ཤེས་རབ་འཇིག་རྟེན་ལས་འདས་པ་རྣམ་པར་མི་རྟོག་པ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Thus, from among these that are presented as the perfection of wisdom, here the transcendental, nonconceptual wisdom included in the Buddha level is the perfection of wisdom.

source: །དེ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བ་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, “should make an effort at the perfection of wisdom” means “should make an effort at the absolutely pure perfection of wisdom completely free from all conceptualization.”

source: །ཁ་ཅིག་ན་རེ་འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ཐེག་པ་ཆེན་པོ་ལ་བྱ་བས་ན། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་སྤངས་ཏེ། ཐེག་པ་ཆེན་པོ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ་ཞེས་ཟེར་རོ།
en: Some take the “perfection of wisdom” here to be the Great Vehicle and say, [“make an effort at the perfection of wisdom”] means one should forsake the Śrāvaka and Pratyekabuddha Vehicles and “should make an effort at the Great Vehicle.”

source: །ཁ་ཅིག་ན་རེ་དེ་ལ་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བྱ་བར་གྱུར་པ་དེའི་ཚེ་ནི་དོན་དུ་ཞེས་བྱ་བར་རིག་པར་བྱ་སྟེ།
en: Others say that when the “perfection of wisdom” there is taken as the knowledge of all aspects, understand a dative of purpose.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་དུ་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དོན་དུ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Hence, it means “make an effort for the perfection of wisdom,” for the knowledge of all aspects.

source: །གང་གི་ཚེ་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་བམ། ཐེག་པ་ཆེན་པོ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བར་བརྗོད་པར་གྱུར་པ་དེའི་ཚེ་ནི་ལ་ཞེས་བྱ་བར་བརྗོད་པར་རིག་པར་བྱའོ་ཞེས་ཟེར་རོ།
en: When nonconceptual wisdom or the Great Vehicle is called the “perfection of wisdom” at that time, understand the “at” as a locative.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་ལ་བརྩོན་པ་རྣམ་པ་གསུམ་སྟེ། བསླབ་པ་ལ་བརྩོན་པ་དང་། སྤྱོད་པ་ལ་བརྩོན་པ་དང་། ཡང་དག་པར་འགྲུབ་པ་ལ་བརྩོན་པའོ།
en: The effort in “make an effort at the perfection of wisdom” is threefold: an effort in training, effort in the course of conduct, and effort at accomplishing the final result.

source: །དེ་ལ་ཉན་པ་དང་། བསམ་པ་ལ་སོགས་པའི་དུས་ནི་བསླབ་པ་ལ་བརྩོན་པ་སྟེ། དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་འོག་ནས་འཆད་པའོ།
en: There the effort in training is during the period of listening, thinking, and so on when it then says that they “should make an effort at the perfection of wisdom.”

source: །སྒྲུབ་པའི་དུས་ན་ནི་སྤྱད་པ་ལ་བརྩོན་པར་བྱ་བ་སྟེ་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ་ཞེས་འོག་ནས་འཆད་པའོ།
en: The effort in the course of conduct is during the practice period when it says below that they “should practice the perfection of wisdom.”

source: །རབ་ཏུ་རྟོགས་པའི་དུས་ན་ནི་ཡང་དག་པར་འགྲུབ་པ་ལ་བརྩོན་པ་སྟེ། དེ་ཡང་བརྩོན་པར་བྱེད་པའོ་ཞེས་འོག་ནས་འཆད་པའོ།
en: And the effort at accomplishing the final result is during the realization period when it says below that they “make an effort.”

source: །བྱའོ་ཞེས་བྱ་བ་ནི་བྱ་བར་འོས་པ་སྟེ་བྱ་བར་རིགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The meaning of “should make” is “it is proper to make,” or “it is right to make.”

source: །དེ་དག་གིས་ནི་གང་གིས་བྱ་བ་དང་། གང་ལ་བྱ་བ་དང་། གང་བྱ་བ་རྣམ་པ་དེ་གསུམ་བསྟན་པ་ཡིན་ཏེ།
en: Those three parts of the statement teach the three aspects: by whom an effort has to be made, for what it has to be made, and what has to be done.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ལ་ནི་ངེས་པ་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཉིད་ཀྱིས་བྱ་སྟེ།
en: First, it is made by bodhisattvas, because those in the Śrāvaka and Pratyekabuddha Vehicles are not necessarily destined.

source: དེ་ནི་བསྒྲུབ་པར་བྱ་བ་ཐམས་ཅད་ཀྱི་རྩ་བ་ཡིན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ལ་བྱ་སྟེ།
en: It is made for just the perfection of wisdom because it is the root of all that has to be accomplished.

source: རྒྱུན་དུ་ཆུད་པ་དང་། གུས་པ་དང་འགྲུས་པ་ལ་སོགས་པས་བརྩོན་པར་བྱའོ།
en: The effort has to be done by continually understanding, respecting, and persevering at it and so on.

source: །འདིར་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་དང་། རྒྱུ་ཕུན་སུམ་ཚོགས་པ་དང་། སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་སྟེ།
en: Here there is a completely perfect result, completely perfect cause, and completely perfect preparation. “

source: ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཞེས་བྱ་བ་ནི་འབྲས་བུའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་རྒྱུའོ། །བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་ནི་སྦྱོར་བའོ།
en: Fully awaken to all dharmas in all forms” is the result; “the perfection of wisdom” is the cause; and “should make an effort” is the preparation.

source: །སུམ་བརྒྱ་པ་ལས་གནས་པར་བྱ་བ་དང་། བསྒྲུབ་པར་བྱ་བ་དང་། སེམས་རབ་ཏུ་གཟུང་བར་བྱ་བ་ཇི་སྐད་དུ་བཤད་པ་དེ་བཞིན་དུ་འདིར་ཡང་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཞེས་བྱ་བ་ནི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་བསྟན་པས་གནས་བསྟན་པ་ཡིན་ནོ། །བརྩོན་པར་བྱའོ་ཞེས་བྱ་བས་ནི་བསྒྲུབ་པ་བསྟན་པ་ཡིན་ནོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཞེས་བྱ་བ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བྱ་བའི་ཕྱིར་སེམས་རབ་ཏུ་བཟུང་བ་བསྟན་པ་ཡིན་ནོ།
en: Just like “the stand” that has to be taken, “the achieving” that has to be done, and “the state of mind” one has to be in as explained in the Triśatikā, here too “wants to fully awaken to all dharmas in all forms,” as a teaching about the completely perfect intention, teaches the stand; “should make an effort” teaches the achieving; and “at the perfection of wisdom,” insofar as it should be construed as the nonconceptual perfection of wisdom, teaches the state of mind one has to be in.

source: །དེ་ལྟར་མགོ་སྨོས་པས་གོ་བ་རྣམས་ཀྱི་དོན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མདོར་བཤད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པ་དང་།
en: Having thus finished his brief explanation of the perfection of wisdom for those who understand by means of a brief indication, the Lord then fell completely silent.

source: དེའི་འོག་ཏུ་གནས་བརྟན་ཤཱ་རིའི་བུས་རྣམ་པར་སྤྲོས་ན་གོ་བ་རྣམས་ཀྱི་དོན་དུ་འབྲིང་དུ་བཤད་པའི་སྐབས་དབྱེ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འཚལ་བས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱི་ཞེས་བྱ་བ་ནི་ཞུ་བ་བརྩམས་སོ།
en: Explanation of the Intermediate Teaching Brief teaching Then the elder Śāriputra, for the sake of those who understand when there is an elaboration, starts the intermediate teaching with this question: “How then, Lord, should bodhisattva great beings who want to fully awaken to all dharmas in all forms make an effort at the perfection of wisdom?”

source: །དེས་ནི་ཆོས་རྣམ་པ་བཞིས་ཞུས་པ་ཡིན་ཏེ།
en: This is a fourfold question about the Dharma: What are “bodhisattva great beings”?

source: ཇི་ལྟར་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འཚལ་ཞེས་བྱ་བ་དང་།
en: What is “want to fully awaken to all dharmas in all forms”?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་དང་།
en: What is “should make an effort at”?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་དང་། ཇི་ལྟར་བརྩོན་པར་བགྱི་ཞེས་བྱ་བ་རྣམས་ཏེ།
en: And what is “the perfection of wisdom”?

source: དེ་བཞི་ཡང་འོག་ནས་སྐབས་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་ཏོ། །དེ་སྐད་ཞུས་པ་དང་།
en: Again, there will be an explanation of the four below in their appropriate context.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་འདི་ལ་འོག་ནས་མདོ་དང་། རྒྱས་པར་བཤད་པ་རྣམ་པ་གཉིས་སུ་མཛད་དོ།
en: Venerable Śāriputra having thus inquired, the Lord, in his explanation, then gives a twofold exposition, brief and detailed.

source: །དེ་ལ་ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ནས་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ལ་ཐུག་གི་བར་དུ་མདོར་བཤད་པའི་སྒོ་ནས་ཆོས་ཐམས་ཅད་བསྡུས་ཏེ་བསྟན་པ་མཛད་དོ།
en: From, “Śāriputra, here bodhisattva great beings, having stood in the perfection of wisdom by way of not taking their stand on it,” up to “should cultivate… great love, great compassion, great joy, and great equanimity,” brings together all dharmas and teaches by way of a brief exposition.

source: །དེའི་འོག་ཏུ་ཆོས་དེ་དག་ཉིད་བཟུང་ནས་རྒྱས་པར་བཤད་པ་མཛད་དོ།
en: Then, starting from just those dharmas, it gives a detailed exposition. “

source: །ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྤྱོད་པ་རྣམ་པ་བཞི་སྟོན་ཏོ། །དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་འདིས་ནི་སྤྱོད་པ་བཞི་བསྟན་པ་ཡིན་ཏེ།
en: Śāriputra, here bodhisattva great beings, having stood in the perfection of wisdom by way of not taking their stand on it,” and so on, teaches four practices, which is to say, the four practices taught by this: “should… make an effort at the perfection of wisdom.”

source: རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་མེད་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་སྤྱོད་པ་དང་། གནོད་པ་མེད་པར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྤྱོད་པ་དང་། གོས་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པའོ།
en: They are the practice of the nonconceptual perfections;practice in harmony with the dharmas on the side of awakening without the secondary afflictions;practice without harming that brings beings to maturity; andpractice without stains that brings the buddhadharmas to maturity.

source: །དེ་ལ་ཐབས་མཁས་པས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་འགྲུབ་པོ། །ཡོངས་སུ་འདྲིས་པའི་ཤེས་པས་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་སྤྱོད་པ་འགྲུབ་པོ། །སྙིང་རྗེས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པ་འགྲུབ་པོ། །ཤེས་རབ་ཀྱིས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པ་འགྲུབ་པོ།
en: Among these, the practice of the perfections is accomplished with skillful means; the practice of the dharmas on the side of awakening is accomplished through knowledge of mastery; the practice of bringing beings to maturity is accomplished through compassion; and the practice of fully developing the buddhadharmas is accomplished with wisdom.

source: །དེ་ལ་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་བསྟན་ཏོ།
en: There, “having stood in the perfection of wisdom by way of not taking their stand on it” and so on teaches the practice of the perfections.

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞིས་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བ་ལ་ཐུག་གི་བར་དུ་ནི་ཉོན་མོངས་པ་མེད་པའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་སྤྱོད་པ་བསྟན་ཏོ།
en: From, “Śāriputra, bodhisattva great beings, having stood in the perfection of wisdom, should perfect the four applications of mindfulness,” and so on, up until “they should perfect … the wishlessness meditative stabilization,” teaches the practice of the dharmas on the side of awakening that is the absence of afflictions.

source: །བསམ་གཏན་བཞི་དང་ཞེས་བྱ་བ་ནས་སེམས་ཅན་གྱི་གནས་དགུ་དང་ཞེས་བྱ་བ་ལ་ཐུག་པའི་བར་གྱིས་ནི་གནོད་པ་མེད་པར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པ་བསྟན་ཏོ།
en: From “the four concentrations” up until “the nine abodes of beings” teaches the practice without harming that brings beings to maturity.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། བཏང་སྙོམས་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བ་ལ་ཐུག་གི་བར་དུ་ནི་གོས་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྤྱོད་པ་བསྟན་ཏོ།
en: From “they should perfect… the ten tathāgata powers,” and so on, up until “great equanimity” teaches the practice without stains that brings the buddhadharmas to maturity.

source: །དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ནི་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ནི་གནས་པ་དང་།
en: Practice of the perfections There, “having stood in the perfection of wisdom by way of not taking their stand on it,” and so on, teaches the practice of the perfections.
